УправлениеВетеринарнойКлиникой/src/Documents/ЗаписьНаПрием/ЗаписьНаПрием.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьНаПрием</name>
  <registerRecords>InformationRegister.РасписаниеВрачей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Питомец</name>
    <type>
      <types>CatalogRef.Питомцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <comment>В минутах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаписи</name>
    <type>
      <types>EnumRef.СтатусыЗаписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеВетеринарнойКлиникой/src/Enums/СтатусыЗаписи/СтатусыЗаписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаписи</name>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

УправлениеВетеринарнойКлиникой/src/Documents/ЗаписьНаПрием/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.ПустаяСсылка") Тогда
		Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.Запланирован");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.ПустаяСсылка") Тогда
		Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.Запланирован");
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте Асинх
//Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	Если Объект.ДатаВремяНачала < ТекущаяДата() И Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.Запланирован") Тогда
//		Ответ = Ждать ВопросАсинх("Установить статус записи как 'Выполнен'?", РежимДиалогаВопрос.ДаНет);
//		
//		Если Ответ = КодВозвратаДиалога.Да Тогда
//			Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.Выполнен");
//		КонецЕсли
//	КонецЕсли;
//КонецПроцедуры
#КонецОбласти




#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Если Объект.Услуга <> Неопределено Тогда
        // Выполним запрос к базе данных, чтобы получить продолжительность услуги
        Продолжительность = ПолучитьПродолжительностьУслуги(Объект.Услуга);
        Объект.Продолжительность = Продолжительность;
    Иначе
        Объект.Продолжительность = 30;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяНачалаПриИзменении(Элемент)
	Если Объект.ДатаВремяНачала < ТекущаяДата() Тогда
		Объект.ДатаВремяНачала = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата начала приёма не может быть меньше сегодняшней даты!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти



&НаКлиенте
Асинх Процедура ОтменаПриёма(Команда)
	
	Ответ = Ждать ВопросАсинх("Вы действительно хотите отменить прием?", РежимДиалогаВопрос.ДаНет);
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        // Выполняем отмену на сервере
        ВыполнитьОтменуНаСервере();
    КонецЕсли;
    
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Приём успешно отменён!";
    Сообщение.Поле = "СтатусЗаписи";
    Сообщение.УстановитьДанные(Объект);
	Сообщение.Сообщить();
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВыполнитьОтменуНаСервере()
    
    Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.Отменен");
    ПараметрыЗаписи = Новый Структура();
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
    ПараметрыЗаписи.Вставить("РежимПроведения", РежимПроведенияДокумента.Оперативный);
    Записать(ПараметрыЗаписи);
    
КонецПроцедуры

&НаСервере
Функция ПолучитьПродолжительностьУслугиНаСервере(СсылкаНаУслугу)
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Услуги.Продолжительность КАК Продолжительность
        |ИЗ
        |	Справочник.Услуги КАК Услуги
        |ГДЕ
        |	Услуги.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаУслугу);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Продолжительность;
    Иначе
        Возврат 30;
    КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПолучитьПродолжительностьУслуги(СсылкаНаУслугу)
    Возврат ПолучитьПродолжительностьУслугиНаСервере(СсылкаНаУслугу);
КонецФункции

#КонецОбласти
